#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

      + service_account_user_id = (known after apply)
    }

  # module.KEYCLOAK_DEV.module.moh_applications.module.USER-MANAGEMENT-SERVICE-INTEGRATION-TESTS.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["USER-MANAGEMENT-SERVICE/view-client-plr"] will be created
  + resource "keycloak_openid_client_service_account_role" "ROLE" {
      + client_id               = (known after apply)
      + id                      = (known after apply)
      + realm_id                = "moh_applications"
      + role                    = "view-client-plr"
      + service_account_user_id = (known after apply)
    }

  # module.KEYCLOAK_DEV.module.moh_applications.module.USER-MANAGEMENT-SERVICE-INTEGRATION-TESTS.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["USER-MANAGEMENT-SERVICE/view-clients"] will be created
  + resource "keycloak_openid_client_service_account_role" "ROLE" {
      + client_id               = (known after apply)
      + id                      = (known after apply)
      + realm_id                = "moh_applications"
      + role                    = "view-clients"
      + service_account_user_id = (known after apply)
    }

  # module.KEYCLOAK_DEV.module.moh_applications.module.USER-MANAGEMENT-SERVICE-INTEGRATION-TESTS.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["USER-MANAGEMENT-SERVICE/view-events"] will be created
  + resource "keycloak_openid_client_service_account_role" "ROLE" {
      + client_id               = (known after apply)
      + id                      = (known after apply)
      + realm_id                = "moh_applications"
      + role                    = "view-events"
      + service_account_user_id = (known after apply)
    }

  # module.KEYCLOAK_DEV.module.moh_applications.module.USER-MANAGEMENT-SERVICE-INTEGRATION-TESTS.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["USER-MANAGEMENT-SERVICE/view-groups"] will be created
  + resource "keycloak_openid_client_service_account_role" "ROLE" {
      + client_id               = (known after apply)
      + id                      = (known after apply)
      + realm_id                = "moh_applications"
      + role                    = "view-groups"
      + service_account_user_id = (known after apply)
    }

  # module.KEYCLOAK_DEV.module.moh_applications.module.USER-MANAGEMENT-SERVICE-INTEGRATION-TESTS.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["USER-MANAGEMENT-SERVICE/view-metrics"] will be created
  + resource "keycloak_openid_client_service_account_role" "ROLE" {
      + client_id               = (known after apply)
      + id                      = (known after apply)
      + realm_id                = "moh_applications"
      + role                    = "view-metrics"
      + service_account_user_id = (known after apply)
    }

  # module.KEYCLOAK_DEV.module.moh_applications.module.USER-MANAGEMENT-SERVICE-INTEGRATION-TESTS.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["USER-MANAGEMENT-SERVICE/view-users"] will be created
  + resource "keycloak_openid_client_service_account_role" "ROLE" {
      + client_id               = (known after apply)
      + id                      = (known after apply)
      + realm_id                = "moh_applications"
      + role                    = "view-users"
      + service_account_user_id = (known after apply)
    }

  # module.KEYCLOAK_DEV.module.moh_applications.module.USER-MANAGEMENT-SERVICE-INTEGRATION-TESTS.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["realm-management/manage-users"] will be created
  + resource "keycloak_openid_client_service_account_role" "ROLE" {
      + client_id               = "1b2ce61a-1235-4a0e-8334-1ac557151757"
      + id                      = (known after apply)
      + realm_id                = "moh_applications"
      + role                    = "manage-users"
      + service_account_user_id = (known after apply)
    }

  # module.KEYCLOAK_DEV.module.moh_applications.module.USER-MANAGEMENT-SERVICE-INTEGRATION-TESTS.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["realm-management/view-clients"] will be created
  + resource "keycloak_openid_client_service_account_role" "ROLE" {
      + client_id               = "1b2ce61a-1235-4a0e-8334-1ac557151757"
      + id                      = (known after apply)
      + realm_id                = "moh_applications"
      + role                    = "view-clients"
      + service_account_user_id = (known after apply)
    }

  # module.KEYCLOAK_DEV.module.moh_applications.module.USER-MANAGEMENT-SERVICE-INTEGRATION-TESTS.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["realm-management/view-events"] will be created
  + resource "keycloak_openid_client_service_account_role" "ROLE" {
      + client_id               = "1b2ce61a-1235-4a0e-8334-1ac557151757"
      + id                      = (known after apply)
      + realm_id                = "moh_applications"
      + role                    = "view-events"
      + service_account_user_id = (known after apply)
    }

  # module.KEYCLOAK_DEV.module.moh_applications.module.USER-MANAGEMENT-SERVICE-INTEGRATION-TESTS.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["realm-management/view-users"] will be created
  + resource "keycloak_openid_client_service_account_role" "ROLE" {
      + client_id               = "1b2ce61a-1235-4a0e-8334-1ac557151757"
      + id                      = (known after apply)
      + realm_id                = "moh_applications"
      + role                    = "view-users"
      + service_account_user_id = (known after apply)
    }

Plan: 37 to add, 0 to change, 23 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @alex-tremblay-cgi, Action: `pull_request`*